src/DataProcessors/КИИ_ГенераторДиаграмм/КИИ_ГенераторДиаграмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_ГенераторДиаграмм</name>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЭкспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTMLДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДиаграммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.КИИ_ЭкспертыИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>URLKroki</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийSVG</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДиаграммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимГенерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникKroki</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Catalogs/КИИ_ЭкспертыИИ/КИИ_ЭкспертыИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_ЭкспертыИИ</name>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЭксперта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииЗнаний</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КИИ_КатегорииЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/КИИ_ГенераторДиаграмм/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме БСП.
//
// Возвращаемое значение:
//   Структура - сведения о внешней обработке:
//     * Вид             - Строка
//     * Наименование    - Строка
//     * Версия          - Строка
//     * БезопасныйРежим - Булево
//     * Информация      - Строка
//     * Команды         - ТаблицаЗначений
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",             "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование",    НСтр("ru = 'Генератор диаграмм'"));
	ПараметрыРегистрации.Вставить("Версия",          "2.0.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация",
		НСтр("ru = 'Генератор диаграмм (Mermaid, PlantUML, GraphViz и др.) с помощью ИИ
			|или по готовому коду. Рендеринг через kroki.'"));

	Команды = НоваяТаблицаКоманд();
	ДобавитьКоманду(Команды,
		НСтр("ru = 'Генератор диаграмм'"),
		"ОткрытьФорму",
		"ОткрытиеФормы",
		Истина);
	ПараметрыРегистрации.Вставить("Команды", Команды);

	Возврат ПараметрыРегистрации;

КонецФункции

// Проверяет доступность подсистемы ИИкона (наличие модуля КИИ_КоннекторИИ).
//
// Возвращаемое значение:
//   Булево - Истина, если подсистема доступна
//
Функция ПроверитьНаличиеИИконы() Экспорт

	Если Метаданные.ОбщиеМодули.Найти("КИИ_КоннекторИИ") <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Определяет вид диаграммы по первым строкам кода.
// Поддерживаемые виды: mermaid, plantuml, graphviz, bpmn.
// При неопределенном виде возвращает "mermaid" (по умолчанию).
//
// Параметры:
//   КодДиаграммы - Строка - код диаграммы
//
// Возвращаемое значение:
//   Строка - "mermaid" | "plantuml" | "graphviz" | "bpmn"
//
Функция ОпределитьВидДиаграммы(КодДиаграммы) Экспорт

	Текст = НРег(СокрЛП(КодДиаграммы));

	// PlantUML
	Если СтрНачинаетсяС(Текст, "@startuml") Тогда
		Возврат "plantuml";
	КонецЕсли;

	// GraphViz (DOT): digraph или graph с фигурной скобкой
	// "graph TD" - это Mermaid, "graph {" - это GraphViz
	ЭтоGraphViz = НачинаетсяСодним(Текст, "digraph", "strict digraph", "strict graph", "graph {", "graph{");
	Если ЭтоGraphViz Тогда
		Возврат "graphviz";
	КонецЕсли;

	// BPMN (XML-формат)
	Если СтрНайти(Текст, "<definitions") > 0
		Или СтрНайти(Текст, "<bpmn:definitions") > 0 Тогда
		Возврат "bpmn";
	КонецЕсли;

	// Mermaid - проверяем ключевые слова
	МаркерыMermaid = "graph td,graph lr,graph tb,graph bt,graph rl,"
		+ "flowchart td,flowchart lr,flowchart tb,flowchart bt,flowchart rl,"
		+ "sequencediagram,classdiagram,statediagram,erdiagram,"
		+ "gantt,pie,journey,gitgraph,mindmap,timeline,%%{init";
	МассивМаркеров = СтрРазделить(МаркерыMermaid, ",");
	Для Каждого Маркер Из МассивМаркеров Цикл
		Если СтрНачинаетсяС(Текст, Маркер) Тогда
			Возврат "mermaid";
		КонецЕсли;
	КонецЦикла;

	Возврат "mermaid"; // По умолчанию

КонецФункции

// Создает структуру параметров рендеринга со значениями по умолчанию.
//
// Возвращаемое значение:
//   Структура - параметры рендеринга:
//     * URLKroki - Строка - базовый URL kroki (умолч. "http://localhost:8000")
//     * Тема     - Строка - тема оформления (для mermaid: "default"/"dark"/"forest"/"neutral")
//     * Формат   - Строка - формат вывода: "svg" | "png" | "pdf" (умолч. "svg")
//     * Таймаут  - Число  - таймаут соединения в секундах (умолч. 30)
//
Функция НовыеПараметрыРендеринга() Экспорт

	Параметры = Новый Структура;
	// Адрес сервера рендеринга: из константы (напр. NAS), пусто - локальный дефолт.
	АдресКонстанты = СокрЛП(Константы.КИИ_АдресСервераKroki.Получить());
	Если ПустаяСтрока(АдресКонстанты) Тогда
		АдресКонстанты = "http://localhost:8000";
	КонецЕсли;
	Параметры.Вставить("URLKroki", АдресКонстанты);
	Параметры.Вставить("Тема",     "default");
	Параметры.Вставить("Формат",   "svg");
	Параметры.Вставить("Таймаут",  30);

	Возврат Параметры;

КонецФункции

// Рендерит диаграмму через kroki и возвращает результат.
// Использует plain text POST API kroki для передачи исходного кода диаграммы.
//
// Параметры:
//   КодДиаграммы        - Строка - исходный код диаграммы
//   ВидДиаграммы        - Строка - "mermaid" | "plantuml" | "graphviz" | ...
//   ПараметрыРендеринга - Структура, Неопределено - параметры из НовыеПараметрыРендеринга():
//     * URLKroki - Строка - базовый URL kroki
//     * Тема     - Строка - тема оформления
//     * Формат   - Строка - формат вывода: "svg" | "png" | "pdf"
//     * Таймаут  - Число  - таймаут соединения в секундах
//
// Возвращаемое значение:
//   Структура:
//     * Успех          - Булево
//     * SVGТекст       - Строка - SVG-текст (только для Формат = "svg")
//     * ДвоичныеДанные - ДвоичныеДанные, Неопределено - для Формат = "png" или "pdf"
//     * Формат         - Строка - формат вывода: "svg" | "png" | "pdf"
//     * ТекстОшибки    - Строка
//
Функция РендеритьЧерезKroki(КодДиаграммы, ВидДиаграммы, ПараметрыРендеринга = Неопределено) Экспорт

	НастройкиKroki = НовыеПараметрыРендеринга();
	ОбъединитьПараметрыРендеринга(НастройкиKroki, ПараметрыРендеринга);

	Результат = Новый Структура("Успех, SVGТекст, ДвоичныеДанные", Ложь, "", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Формат", НРег(НастройкиKroki.Формат));

	// Подготавливаем код (для mermaid добавляет директиву темы)
	КодЧистый = ПодготовитьКодДляKroki(КодДиаграммы, ВидДиаграммы, НастройкиKroki.Тема);
	ИмяТипа   = ИмяТипаДляKroki(ВидДиаграммы);

	ПараметрыURL = РазобратьURL(НастройкиKroki.URLKroki);

	// Endpoint: POST /{type}/{format} с plain text телом - корректно передает UTF-8
	ПутьЗапроса = "/" + ИмяТипа + "/" + НРег(НастройкиKroki.Формат);

	Попытка
		Соединение = СоздатьСоединениеKroki(ПараметрыURL, НастройкиKroki.Таймаут);
		Запрос = СоздатьЗапросKroki(ПутьЗапроса, КодЧистый, НастройкиKroki.Формат);
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ЗаполнитьРезультатОтветаKroki(Ответ, НастройкиKroki.Формат, Результат);
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка соединения с kroki: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат.ТекстОшибки = ТекстОшибки;
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.ГенераторДиаграмм'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Строит HTML-страницу для отображения SVG через HTMLДокументПоле.
// SVG встраивается через data URI (base64), что исключает проблемы с CORS.
//
// Параметры:
//   SVGТекст    - Строка - SVG-текст, полученный от kroki
//   ФонСтраницы - Строка - CSS-цвет фона (умолч. "white")
//
// Возвращаемое значение:
//   Строка - HTML-документ
//
Функция ПостроитьHTMLДляПросмотра(SVGТекст, ФонСтраницы = "white") Экспорт

	SVGДанные = ПолучитьДвоичныеДанныеИзСтроки(SVGТекст, КодировкаТекста.UTF8);
	SVGBase64 = Base64Строка(SVGДанные);
	// Убираем переносы строк из base64 (платформа добавляет их каждые 76 символов)
	SVGBase64 = СтрЗаменить(SVGBase64, Символы.ПС, "");
	SVGBase64 = СтрЗаменить(SVGBase64, Символ(13), "");

	HTML = "<!DOCTYPE html>"
		+ "<html><head><meta charset=""UTF-8""><style>"
		+ "body{margin:0;padding:8px;background:" + ФонСтраницы
		+ ";display:flex;justify-content:center;align-items:flex-start;}"
		+ "img{max-width:100%;height:auto;}"
		+ "</style></head><body>"
		+ "<img src=""data:image/svg+xml;base64," + SVGBase64 + """ alt=""diagram"">"
		+ "</body></html>";

	Возврат HTML;

КонецФункции

// Строит HTML-страницу для отображения бинарного результата рендеринга (png/pdf)
// через data URI. PNG встраивается тегом img, PDF - тегом embed (best-effort).
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные, Неопределено - бинарный результат рендеринга kroki
//   Формат         - Строка - "png" | "pdf"
//   ФонСтраницы    - Строка - CSS-цвет фона (умолч. "white")
//
// Возвращаемое значение:
//   Строка - HTML-документ
//
Функция ПостроитьHTMLДляПросмотраБинарного(Знач ДвоичныеДанные, Знач Формат, ФонСтраницы = "white") Экспорт

	Заголовок = "<!DOCTYPE html>"
		+ "<html><head><meta charset=""UTF-8""><style>"
		+ "body{margin:0;padding:8px;background:" + ФонСтраницы
		+ ";display:flex;justify-content:center;align-items:flex-start;}"
		+ "img{max-width:100%;height:auto;}embed{width:100%;height:95vh;}"
		+ "</style></head><body>";
	Подвал = "</body></html>";

	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Заголовок + Подвал;
	КонецЕсли;

	Base64 = Base64Строка(ДвоичныеДанные);
	Base64 = СтрЗаменить(Base64, Символы.ПС, "");
	Base64 = СтрЗаменить(Base64, Символ(13), "");

	Если НРег(Формат) = "pdf" Тогда
		Встраивание = "<embed src=""data:application/pdf;base64," + Base64
			+ """ type=""application/pdf"">";
	Иначе
		Встраивание = "<img src=""data:image/png;base64," + Base64 + """ alt=""diagram"">";
	КонецЕсли;

	Возврат Заголовок + Встраивание + Подвал;

КонецФункции

// Универсальная точка входа для внешних вызовов.
// Принимает текстовое описание (→ ИИ) или готовый код диаграммы любого типа.
// Рендерит через kroki, возвращает SVG + HTML.
//
// Параметры:
//   ОписаниеИлиКод      - Строка    - описание или готовый код
//   НастройкиОформления - Структура - необязательно:
//     * URLKroki    - Строка - URL kroki (умолч. "http://localhost:8000")
//     * Тема        - Строка - тема Mermaid (умолч. "default")
//     * ФонСтраницы - Строка - фон (умолч. "white")
//     * Таймаут     - Число  - таймаут HTTP запроса в секундах (умолч. 30)
//   Эксперт             - СправочникСсылка.КИИ_ЭкспертыИИ - нужен при генерации по описанию
//
// Возвращаемое значение:
//   Структура:
//     * КодДиаграммы - Строка
//     * ВидДиаграммы - Строка
//     * SVGТекст     - Строка
//     * HTML         - Строка
//     * ЭтоОшибка   - Булево
//     * ТекстОшибки  - Строка
//
Функция СгенерироватьДиаграмму(ОписаниеИлиКод, НастройкиОформления = Неопределено, Эксперт = Неопределено) Экспорт

	Результат = НовыйРезультатГенерации();
	Оформление = РазобратьНастройкиОформления(НастройкиОформления);

	Если Не ЗаполнитьКодДиаграммыВРезультате(Результат, ОписаниеИлиКод, Эксперт) Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.ВидДиаграммы = ОпределитьВидДиаграммы(Результат.КодДиаграммы);

	ПараметрыKroki = НовыеПараметрыРендеринга();
	ПараметрыKroki.URLKroki = Оформление.URLKroki;
	ПараметрыKroki.Тема     = Оформление.Тема;
	ПараметрыKroki.Таймаут  = Оформление.Таймаут;
	РезультатKroki = РендеритьЧерезKroki(Результат.КодДиаграммы, Результат.ВидДиаграммы, ПараметрыKroki);

	ПрименитьРезультатРендеринга(Результат, РезультатKroki, Оформление);

	Возврат Результат;

КонецФункции

// Точка входа для фонового задания генерации кода диаграммы через ИИ.
// Вызывается через ДлительныеОперации.ВыполнитьФункцию по имени:
//   "Обработки.КИИ_ГенераторДиаграмм.МодульОбъекта.СгенерироватьКодДиаграммыФоново"
//
// Параметры:
//   ПараметрыЗадания - Структура:
//     * ОписаниеДиаграммы - Строка
//     * Эксперт           - СправочникСсылка.КИИ_ЭкспертыИИ
//
// Возвращаемое значение:
//   Структура:
//     * КодДиаграммы - Строка
//     * ВидДиаграммы - Строка
//     * SVGТекст     - Строка
//     * HTML         - Строка
//     * ЭтоОшибка   - Булево
//     * ТекстОшибки  - Строка
//
Функция СгенерироватьКодДиаграммыФоново(ПараметрыЗадания) Экспорт

	Возврат СгенерироватьКодДиаграммы(
		ПараметрыЗадания.ОписаниеДиаграммы,
		ПараметрыЗадания.Эксперт);

КонецФункции

// Загружает настройки обработки из хранилища (Эксперт, URLKroki, ТемаДиаграммы).
//
Процедура ЗагрузитьНастройки() Экспорт

	КлючОбъекта = "Обработка.КИИ_ГенераторДиаграмм";

	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбъекта, "НастройкиФормы");

	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если Настройки.Свойство("ПоследнийЭксперт") И ЗначениеЗаполнено(Настройки.ПоследнийЭксперт) Тогда
		Эксперт = Настройки.ПоследнийЭксперт;
	КонецЕсли;

	Если Настройки.Свойство("URLKroki") И НЕ ПустаяСтрока(Настройки.URLKroki) Тогда
		URLKroki = Настройки.URLKroki;
	КонецЕсли;

	Если Настройки.Свойство("ТемаДиаграммы") И НЕ ПустаяСтрока(Настройки.ТемаДиаграммы) Тогда
		ТемаДиаграммы = Настройки.ТемаДиаграммы;
	КонецЕсли;

	Если Настройки.Свойство("Таймаут") И НЕ Настройки.Таймаут = 0 Тогда
		Таймаут = Настройки.Таймаут;
	КонецЕсли;

	Если Настройки.Свойство("ИсточникKroki") И НЕ ПустаяСтрока(Настройки.ИсточникKroki) Тогда
		ИсточникKroki = Настройки.ИсточникKroki;
	КонецЕсли;

КонецПроцедуры

// Сохраняет настройки обработки в хранилище (Эксперт, URLKroki, ТемаДиаграммы).
//
Процедура СохранитьНастройки() Экспорт

	КлючОбъекта = "Обработка.КИИ_ГенераторДиаграмм";

	Настройки = Новый Структура;
	Настройки.Вставить("ПоследнийЭксперт", Эксперт);
	Настройки.Вставить("URLKroki",         URLKroki);
	Настройки.Вставить("ТемаДиаграммы",    ТемаДиаграммы);
	Настройки.Вставить("Таймаут",     Таймаут);
	Настройки.Вставить("ИсточникKroki",    ИсточникKroki);

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбъекта, "НастройкиФормы", Настройки);

КонецПроцедуры

// Создает предзаполненного эксперта ИИ для генерации диаграмм.
//
// Возвращаемое значение:
//   Структура:
//     * Успех       - Булево
//     * Эксперт     - СправочникСсылка.КИИ_ЭкспертыИИ
//     * ТекстОшибки - Строка
//
Функция СоздатьПредзаполненногоЭксперта() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успех",       Ложь);
	Результат.Вставить("Эксперт",     Справочники.КИИ_ЭкспертыИИ.ПустаяСсылка());
	Результат.Вставить("ТекстОшибки", "");

	Попытка

		МакетПромпта = ПолучитьМакет("ПромптДиаграммы");
		ТекстПромпта = МакетПромпта.ПолучитьТекст();

		НовыйЭксперт = Справочники.КИИ_ЭкспертыИИ.СоздатьЭлемент();
		НовыйЭксперт.Наименование     = НСтр("ru = 'Генератор диаграмм'");
		НовыйЭксперт.ОписаниеЭксперта = ТекстПромпта;
		НовыйЭксперт.Записать();

		Результат.Успех   = Истина;
		Результат.Эксперт = НовыйЭксперт.Ссылка;

	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.ТекстОшибки = ТекстОшибки;
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.ГенераторДиаграмм'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Выполняет команду внешней обработки из подсистемы БСП.
//
// Параметры:
//   ИдентификаторКоманды - Строка - идентификатор команды БСП
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт

	// В текущей версии все команды открывают форму (обрабатывается платформой автоматически)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Регистрация

Функция НоваяТаблицаКоманд()

	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление",       Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор",       Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование",       Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор",         Новый ОписаниеТипов("Строка"));

	Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(
	Команды,
	Представление,
	Идентификатор,
	Использование,
	ПоказыватьОповещение = Ложь,
	Модификатор = "")

	НоваяКоманда = Команды.Добавить();
	НоваяКоманда.Представление       = Представление;
	НоваяКоманда.Идентификатор       = Идентификатор;
	НоваяКоманда.Использование        = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор          = Модификатор;

КонецПроцедуры

#КонецОбласти

#Область ОпределениеТипаДиаграммы

Функция ИмяТипаДляKroki(ВидДиаграммы)

	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("mermaid",     "mermaid");
	СоответствиеТипов.Вставить("plantuml",    "plantuml");
	СоответствиеТипов.Вставить("c4plantuml",  "c4plantuml");
	СоответствиеТипов.Вставить("graphviz",    "graphviz");
	СоответствиеТипов.Вставить("d2",          "d2");
	СоответствиеТипов.Вставить("structurizr", "structurizr");
	СоответствиеТипов.Вставить("bpmn",        "bpmn");
	СоответствиеТипов.Вставить("erd",         "erd");
	СоответствиеТипов.Вставить("nomnoml",     "nomnoml");
	СоответствиеТипов.Вставить("ditaa",       "ditaa");
	СоответствиеТипов.Вставить("svgbob",      "svgbob");
	СоответствиеТипов.Вставить("blockdiag",   "blockdiag");
	СоответствиеТипов.Вставить("seqdiag",     "seqdiag");
	СоответствиеТипов.Вставить("actdiag",     "actdiag");
	СоответствиеТипов.Вставить("nwdiag",      "nwdiag");
	СоответствиеТипов.Вставить("packetdiag",  "packetdiag");
	СоответствиеТипов.Вставить("rackdiag",    "rackdiag");
	СоответствиеТипов.Вставить("wavedrom",    "wavedrom");
	СоответствиеТипов.Вставить("pikchr",      "pikchr");
	СоответствиеТипов.Вставить("vega",        "vega");
	СоответствиеТипов.Вставить("vegalite",    "vega-lite");
	СоответствиеТипов.Вставить("excalidraw",  "excalidraw");
	СоответствиеТипов.Вставить("wireviz",     "wireviz");
	СоответствиеТипов.Вставить("bytefield",   "bytefield");
	СоответствиеТипов.Вставить("umlet",       "umlet");
	СоответствиеТипов.Вставить("dbml",        "dbml");

	ИмяТипа = СоответствиеТипов[НРег(ВидДиаграммы)];
	Если ИмяТипа = Неопределено Тогда
		ИмяТипа = "mermaid";
	КонецЕсли;

	Возврат ИмяТипа;

КонецФункции
// Подготавливает код диаграммы перед отправкой в kroki.
// Для Mermaid с не-default темой добавляет директиву %%{init}%% перед кодом.
//
// Параметры:
//   КодДиаграммы - Строка - исходный код диаграммы
//   ВидДиаграммы - Строка - вид диаграммы (mermaid, plantuml и т.д.)
//   Тема         - Строка - тема оформления (умолч. "default")
//
// Возвращаемое значение:
//   Строка - подготовленный код диаграммы
//
Функция ПодготовитьКодДляKroki(КодДиаграммы, ВидДиаграммы, Тема = "default") Экспорт

	Код = СокрЛП(КодДиаграммы);

	ЭтоMermaidСТемой = НРег(ВидДиаграммы) = "mermaid"
		И НЕ ПустаяСтрока(Тема)
		И Тема <> "default"
		И НЕ СтрНачинаетсяС(Код, "%%");
	Если ЭтоMermaidСТемой Тогда
		ДирективаТемы = "%%" + "{init: {'theme': '" + Тема + "'}}" + "%%";
		Код = ДирективаТемы + Символы.ПС + Код;
	КонецЕсли;

	Возврат Код;

КонецФункции
// Проверяет, является ли текст готовым кодом диаграммы любого поддерживаемого типа.
//
// Параметры:
//   Текст - Строка - текст для анализа
//
// Возвращаемое значение:
//   Булево - Истина, если текст является кодом поддерживаемого типа диаграммы
//
Функция ЭтоГотовыйКодДиаграммы(Текст) Экспорт

	ТекстНорм = НРег(СокрЛП(Текст));

	Если СтрНачинаетсяС(ТекстНорм, "@startuml") Тогда
		Возврат Истина;
	КонецЕсли;

	ЭтоGraphViz = НачинаетсяСодним(ТекстНорм, "digraph", "strict digraph", "strict graph", "graph {", "graph{");
	Если ЭтоGraphViz Тогда
		Возврат Истина;
	КонецЕсли;

	Если СтрНайти(ТекстНорм, "<definitions") > 0 Тогда
		Возврат Истина;
	КонецЕсли;

	МаркерыMermaid = "graph td,graph lr,graph tb,graph bt,graph rl,"
		+ "flowchart td,flowchart lr,flowchart tb,flowchart bt,flowchart rl,"
		+ "sequencediagram,classdiagram,statediagram,erdiagram,"
		+ "gantt,pie,journey,gitgraph,mindmap,timeline,%%{init";
	МассивМаркеров = СтрРазделить(МаркерыMermaid, ",");
	Для Каждого Маркер Из МассивМаркеров Цикл
		Если СтрНачинаетсяС(ТекстНорм, Маркер) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область KrokiHTTP

// Проверяет доступность kroki через /healthcheck.
//
// Параметры:
//   URLKroki - Строка - базовый URL kroki
//   Таймаут  - Число  - таймаут соединения в секундах (умолч. 5)
//
// Возвращаемое значение:
//   Структура:
//     * Доступен  - Булево
//     * Сообщение - Строка
//
Функция ПроверитьДоступностьKroki(URLKroki, Таймаут = 5) Экспорт

	Результат = Новый Структура("Доступен, Сообщение", Ложь, "");

	ПараметрыURL = РазобратьURL(URLKroki);

	Попытка

		Если ПараметрыURL.Защищенное Тогда
			Соединение = Новый HTTPСоединение(
				ПараметрыURL.Хост, ПараметрыURL.Порт, , , , Таймаут,
				ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		Иначе
			Соединение = Новый HTTPСоединение(
				ПараметрыURL.Хост, ПараметрыURL.Порт, , , , Таймаут);
		КонецЕсли;

		Запрос = Новый HTTPЗапрос("/health");
		Ответ  = Соединение.Получить(Запрос);

		Если Ответ.КодСостояния = 200 Тогда
			Результат.Доступен  = Истина;
			Результат.Сообщение = НСтр("ru = 'Kroki доступен'");
		Иначе
			Результат.Сообщение = СтрШаблон(
				НСтр("ru = 'Kroki вернул код %1'"), Ответ.КодСостояния);
		КонецЕсли;

	Исключение
		Результат.Сообщение = СтрШаблон(
			НСтр("ru = 'Kroki недоступен: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Разбирает URL на составляющие (хост, порт, признак защищенности).
//
// Параметры:
//   URL - Строка - например "http://localhost:8000" или "https://kroki.io"
//
// Возвращаемое значение:
//   Структура:
//     * Хост       - Строка
//     * Порт       - Число
//     * Защищенное - Булево
//
Функция РазобратьURL(URL) Экспорт

	УRI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);

	Результат = Новый Структура("Хост, Порт, Защищенное", "", 0, Ложь);
	Результат.Хост       = УRI.Хост;
	Результат.Защищенное = (НРег(УRI.Схема) = "https");

	Если НЕ ПустаяСтрока(УRI.Порт) Тогда
		Результат.Порт = Число(УRI.Порт);
	ИначеЕсли Результат.Защищенное Тогда
		Результат.Порт = 443;
	Иначе
		Результат.Порт = 80;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ГенерацияЧерезИИ

Функция СгенерироватьКодДиаграммы(ОписаниеДиаграммы, Эксперт) Экспорт

	Результат = НовыйРезультатГенерации();

	Если ПустаяСтрока(ОписаниеДиаграммы) Тогда
		Результат.ЭтоОшибка  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнено описание диаграммы'");
		Возврат Результат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Эксперт) Тогда
		Результат.ЭтоОшибка  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнен Эксперт ИИ'");
		Возврат Результат;
	КонецЕсли;

	Если Не ПроверитьНаличиеИИконы() Тогда
		Результат.ЭтоОшибка  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Подсистема ИИкона не найдена. Установите расширение ИИкона.'");
		Возврат Результат;
	КонецЕсли;

	Модель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "Модель");
	Промпт = СформироватьПромпт(Эксперт, ОписаниеДиаграммы);

	// Модель с function-calling строит диаграмму по реальной базе: петля агент-анализа
	// дает ей инструменты структуры конфигурации и данных (get_metadata_tree, execute_query и др.).
	Если КИИ_АгентАнализа.МодельПоддерживаетИнструменты(Модель) Тогда
		РезультатИИ = КИИ_АгентАнализа.ВыполнитьАнализСИнструментами(Модель, Промпт);
	Иначе
		РезультатИИ = КИИ_КоннекторИИ.ЗапросКМодели(Модель, Промпт);
	КонецЕсли;

	Если РезультатИИ.ЭтоОшибка Тогда
		Результат.ЭтоОшибка  = Истина;
		Результат.ТекстОшибки = РезультатИИ.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	ИзвлеченныйКод = ИзвлечьКодИзОтветаИИ(РезультатИИ.ТекстОтвета);
	Если ПустаяСтрока(ИзвлеченныйКод) Тогда
		Результат.ЭтоОшибка  = Истина;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'ИИ не вернул распознаваемый код диаграммы.%1Ответ ИИ:%1%2'"),
			Символы.ПС,
			РезультатИИ.ТекстОтвета);
	Иначе
		Результат.КодДиаграммы = ИзвлеченныйКод;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Извлекает код диаграммы из текстового ответа ИИ.
// Порядок поиска:
//   1. Именованные блоки ```mermaid, ```plantuml, ```dot, ```graphviz, ```bpmn
//   2. Любой блок ``` с распознаваемым содержимым
//   3. Первая строка с маркером диаграммы - берется весь текст с нее
//
// Параметры:
//   ТекстОтвета - Строка - полный текст ответа ИИ
//
// Возвращаемое значение:
//   Строка - извлеченный код; пустая строка, если не распознан
//
Функция ИзвлечьКодИзОтветаИИ(ТекстОтвета) Экспорт

	Текст = СокрЛП(ТекстОтвета);

	Код = ИзвлечьКодИзИменованногоБлока(Текст);
	Если ЗначениеЗаполнено(Код) Тогда
		Возврат Код;
	КонецЕсли;

	Код = ИзвлечьКодИзБезымянногоБлока(Текст);
	Если ЗначениеЗаполнено(Код) Тогда
		Возврат Код;
	КонецЕсли;

	Возврат ИзвлечьКодПоМаркеруДиаграммы(Текст);

КонецФункции

// Стратегия 1: именованный блок ```mermaid/plantuml/dot/graphviz/bpmn.
Функция ИзвлечьКодИзИменованногоБлока(Знач Текст)

	МаркерыЯзыков = СтрРазделить("mermaid,plantuml,dot,graphviz,bpmn", ",");
	Для Каждого Язык Из МаркерыЯзыков Цикл
		Маркер = "```" + Язык;
		Поз = СтрНайти(НРег(Текст), Маркер);
		Если Поз = 0 Тогда
			Продолжить;
		КонецЕсли;
		ТекстПосле = СокрЛ(Сред(Текст, Поз + СтрДлина(Маркер)));
		Если СтрНачинаетсяС(ТекстПосле, Символы.ПС) Тогда
			ТекстПосле = Сред(ТекстПосле, 2);
		КонецЕсли;
		ПозКонца = СтрНайти(ТекстПосле, "```");
		Если ПозКонца > 0 Тогда
			Возврат СокрЛП(Лев(ТекстПосле, ПозКонца - 1));
		Иначе
			Возврат СокрЛП(ТекстПосле);
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Стратегия 2: любой блок ``` с содержимым, похожим на код диаграммы.
Функция ИзвлечьКодИзБезымянногоБлока(Знач Текст)

	Поз = СтрНайти(Текст, "```");
	Если Поз = 0 Тогда
		Возврат "";
	КонецЕсли;

	ТекстПосле = СокрЛ(Сред(Текст, Поз + 3));
	ПервыйПС = СтрНайти(ТекстПосле, Символы.ПС);
	Если ПервыйПС > 0 Тогда
		ТекстПосле = Сред(ТекстПосле, ПервыйПС + 1);
	КонецЕсли;

	ПозКонца = СтрНайти(ТекстПосле, "```");
	Если ПозКонца > 0 Тогда
		КодИзБлока = СокрЛП(Лев(ТекстПосле, ПозКонца - 1));
	Иначе
		КодИзБлока = СокрЛП(ТекстПосле);
	КонецЕсли;

	Если ЭтоГотовыйКодДиаграммы(КодИзБлока) Тогда
		Возврат КодИзБлока;
	КонецЕсли;

	Возврат "";

КонецФункции

// Стратегия 3: маркер диаграммы в обычной строке - берется весь текст с нее.
Функция ИзвлечьКодПоМаркеруДиаграммы(Знач Текст)

	МаркерыДиаграмм = "graph td,graph lr,graph tb,graph bt,graph rl,"
		+ "flowchart,sequencediagram,classdiagram,statediagram,erdiagram,"
		+ "gantt,pie,journey,gitgraph,mindmap,timeline,@startuml,digraph,strict digraph";
	МассивМаркеров = СтрРазделить(МаркерыДиаграмм, ",");
	Строки = СтрРазделить(Текст, Символы.ПС);

	НачалоКода = НайтиСтрокуСМаркеромДиаграммы(Строки, МассивМаркеров);
	Если НачалоКода < 0 Тогда
		Возврат "";
	КонецЕсли;

	КодСтроки = Новый Массив;
	Для Инд = НачалоКода По Строки.ВГраница() Цикл
		КодСтроки.Добавить(Строки[Инд]);
	КонецЦикла;
	Возврат СокрЛП(СтрСоединить(КодСтроки, Символы.ПС));

КонецФункции

// Найти индекс первой строки, начинающейся с одного из маркеров диаграммы.
Функция НайтиСтрокуСМаркеромДиаграммы(Знач Строки, Знач МассивМаркеров)

	Для Инд = 0 По Строки.ВГраница() Цикл
		СтрокаНорм = НРег(СокрЛП(Строки[Инд]));
		Для Каждого Маркер Из МассивМаркеров Цикл
			Если СтрНачинаетсяС(СтрокаНорм, Маркер) Тогда
				Возврат Инд;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат -1;

КонецФункции

Функция НовыйРезультатГенерации()

	Результат = Новый Структура;
	Результат.Вставить("КодДиаграммы", "");
	Результат.Вставить("ВидДиаграммы", "");
	Результат.Вставить("SVGТекст",     "");
	Результат.Вставить("HTML",         "");
	Результат.Вставить("ЭтоОшибка",   Ложь);
	Результат.Вставить("ТекстОшибки",  "");

	Возврат Результат;

КонецФункции

Функция СформироватьПромпт(Эксперт, ТекстПромпта)

	СистемныйПромпт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "ОписаниеЭксперта");

	Результат = Новый Структура;
	Результат.Вставить("СистемныйПромпт",        СистемныйПромпт);
	Результат.Вставить("ПользовательскийПромпт", ТекстПромпта);
	Результат.Вставить("ИсторияСообщений",       Новый Массив);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область MermaidJS
// Резервный HTML для рендеринга через встроенный mermaid.js.
// Используется когда kroki недоступен (только для Mermaid-диаграмм).
//
// Параметры:
//   КодДиаграммы - Строка - код Mermaid-диаграммы
//   Тема         - Строка - тема оформления Mermaid (умолч. "default")
//   ФонСтраницы  - Строка - CSS-цвет фона (умолч. "white")
//
// Возвращаемое значение:
//   Строка - HTML-документ для отображения в HTMLДокументПоле
//
Функция HTMLДиаграммыMermaid(КодДиаграммы, Тема = "default", ФонСтраницы = "white") Экспорт

	МакетHTML = ПолучитьМакет("ШаблонMermaid");
	HTMLТекст = МакетHTML.ПолучитьТекст();

	КодДиаграммыJS = СтрЗаменить(КодДиаграммы,   Символ(92), Символ(92) + Символ(92));
	КодДиаграммыJS = СтрЗаменить(КодДиаграммыJS, Символ(39), Символ(92) + Символ(39));
	КодДиаграммыJS = СтрЗаменить(КодДиаграммыJS, Символ(13), "");
	КодДиаграммыJS = СтрЗаменить(КодДиаграммыJS, Символ(10), Символ(92) + "n");

	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_CODE%",    КодДиаграммыJS);
	ТемаДляHTML = Тема;
	Если ПустаяСтрока(ТемаДляHTML) Тогда
		ТемаДляHTML = "default";
	КонецЕсли;
	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_THEME%", ТемаДляHTML);
	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_FONTSIZE%", "14px");
	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_CURVE%",   "basis");
	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_BGPAGE%",  ФонСтраницы);

	МакетJS  = ПолучитьМакет("mermaid_js");
	ПотокJS  = МакетJS.ОткрытьПотокДляЧтения();
	ЧтениеJS = Новый ЧтениеТекста(ПотокJS, КодировкаТекста.UTF8);
	КодJS    = ЧтениеJS.Прочитать();
	ЧтениеJS.Закрыть();

	Для КодСимвола = 0 По 31 Цикл
		Если КодСимвола = 9 Или КодСимвола = 10 Или КодСимвола = 13 Тогда
			Продолжить;
		КонецЕсли;
		КодJS = СтрЗаменить(КодJS, Символ(КодСимвола), "");
	КонецЦикла;

	HTMLТекст = СтрЗаменить(HTMLТекст, "%MERMAID_JS_LIBRARY%", КодJS);

	Возврат HTMLТекст;

КонецФункции

#КонецОбласти

#Область ВспомогательныеМетодыРендеринга

// Проверить, начинается ли текст с одного из перечисленных префиксов.
//
//
// BSLLS:NumberOfOptionalParams-off
Функция НачинаетсяСодним(Знач Текст, Знач Префикс1, Знач Префикс2 = "",
	Знач Префикс3 = "", Знач Префикс4 = "", Знач Префикс5 = "")
// BSLLS:NumberOfOptionalParams-on

	Возврат СтрНачинаетсяС(Текст, Префикс1)
		Или (НЕ ПустаяСтрока(Префикс2) И СтрНачинаетсяС(Текст, Префикс2))
		Или (НЕ ПустаяСтрока(Префикс3) И СтрНачинаетсяС(Текст, Префикс3))
		Или (НЕ ПустаяСтрока(Префикс4) И СтрНачинаетсяС(Текст, Префикс4))
		Или (НЕ ПустаяСтрока(Префикс5) И СтрНачинаетсяС(Текст, Префикс5));

КонецФункции

// Скопировать непустые поля из ПараметрыРендеринга в НастройкиKroki.
Процедура ОбъединитьПараметрыРендеринга(НастройкиKroki, Знач ПараметрыРендеринга)

	Если ТипЗнч(ПараметрыРендеринга) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыРендеринга.Свойство("URLKroki") И НЕ ПустаяСтрока(ПараметрыРендеринга.URLKroki) Тогда
		НастройкиKroki.URLKroki = ПараметрыРендеринга.URLKroki;
	КонецЕсли;
	Если ПараметрыРендеринга.Свойство("Тема") Тогда
		НастройкиKroki.Тема = ПараметрыРендеринга.Тема;
	КонецЕсли;
	Если ПараметрыРендеринга.Свойство("Формат") И НЕ ПустаяСтрока(ПараметрыРендеринга.Формат) Тогда
		НастройкиKroki.Формат = ПараметрыРендеринга.Формат;
	КонецЕсли;
	Если ПараметрыРендеринга.Свойство("Таймаут") И ПараметрыРендеринга.Таймаут > 0 Тогда
		НастройкиKroki.Таймаут = ПараметрыРендеринга.Таймаут;
	КонецЕсли;

КонецПроцедуры

// Создать HTTP-соединение с kroki (http/https).
Функция СоздатьСоединениеKroki(Знач ПараметрыURL, Знач Таймаут)

	Если ПараметрыURL.Защищенное Тогда
		Возврат Новый HTTPСоединение(
			ПараметрыURL.Хост, ПараметрыURL.Порт, , , , Таймаут,
			ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	КонецЕсли;

	Возврат Новый HTTPСоединение(
		ПараметрыURL.Хост, ПараметрыURL.Порт, , , , Таймаут);

КонецФункции

// Создать HTTP-запрос к kroki с кодом диаграммы и нужными заголовками.
Функция СоздатьЗапросKroki(Знач ПутьЗапроса, Знач КодЧистый, Знач Формат)

	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	Запрос.УстановитьТелоИзСтроки(КодЧистый, КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	Запрос.Заголовки["Content-Type"] = "text/plain; charset=utf-8";
	Запрос.Заголовки["Accept"] = ЗаголовокAcceptПоФормату(Формат);
	Возврат Запрос;

КонецФункции

// Получить значение заголовка Accept по формату kroki.
Функция ЗаголовокAcceptПоФормату(Знач Формат)

	Карта = Новый Соответствие;
	Карта.Вставить("svg", "image/svg+xml");
	Карта.Вставить("png", "image/png");
	Карта.Вставить("pdf", "application/pdf");

	Возврат Карта.Получить(НРег(Формат));

КонецФункции

// Заполнить Результат на основании ответа kroki.
Процедура ЗаполнитьРезультатОтветаKroki(Знач Ответ, Знач Формат, Результат)

	Если Ответ.КодСостояния <> 200 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'kroki вернул код %1: %2'"),
			Ответ.КодСостояния, БезопасноПрочитатьТелоКакСтроку(Ответ));
		Возврат;
	КонецЕсли;

	Если НРег(Формат) = "svg" Тогда
		Результат.SVGТекст = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Иначе
		Результат.ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	КонецЕсли;
	Результат.Успех = Истина;

КонецПроцедуры

// Безопасно прочитать тело ответа как строку; при ошибке декодирования - пустая строка.
Функция БезопасноПрочитатьТелоКакСтроку(Знач Ответ)

	Попытка
		Возврат Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

// Разобрать настройки оформления, вернуть структуру с дефолтами.
Функция РазобратьНастройкиОформления(Знач НастройкиОформления)

	Оформление = Новый Структура;
	Оформление.Вставить("URLKroki",    "http://localhost:8000");
	Оформление.Вставить("Тема",        "default");
	Оформление.Вставить("ФонСтраницы", "white");
	Оформление.Вставить("Таймаут",     30);

	Если ТипЗнч(НастройкиОформления) <> Тип("Структура") Тогда
		Возврат Оформление;
	КонецЕсли;

	Если НастройкиОформления.Свойство("URLKroki") И НЕ ПустаяСтрока(НастройкиОформления.URLKroki) Тогда
		Оформление.URLKroki = НастройкиОформления.URLKroki;
	КонецЕсли;
	Если НастройкиОформления.Свойство("Тема") И НЕ ПустаяСтрока(НастройкиОформления.Тема) Тогда
		Оформление.Тема = НастройкиОформления.Тема;
	КонецЕсли;
	Если НастройкиОформления.Свойство("ФонСтраницы") И НЕ ПустаяСтрока(НастройкиОформления.ФонСтраницы) Тогда
		Оформление.ФонСтраницы = НастройкиОформления.ФонСтраницы;
	КонецЕсли;
	Если НастройкиОформления.Свойство("Таймаут") И НастройкиОформления.Таймаут > 0 Тогда
		Оформление.Таймаут = НастройкиОформления.Таймаут;
	КонецЕсли;

	Возврат Оформление;

КонецФункции

// Заполнить Результат.КодДиаграммы из готового кода или вызвав ИИ. Возвращает Ложь при ошибке.
Функция ЗаполнитьКодДиаграммыВРезультате(Результат, Знач ОписаниеИлиКод, Знач Эксперт)

	Если ЭтоГотовыйКодДиаграммы(ОписаниеИлиКод) Тогда
		Результат.КодДиаграммы = СокрЛП(ОписаниеИлиКод);
		Возврат Истина;
	КонецЕсли;

	РезультатКода = СгенерироватьКодДиаграммы(ОписаниеИлиКод, Эксперт);
	Если РезультатКода.ЭтоОшибка Тогда
		Результат.ЭтоОшибка   = Истина;
		Результат.ТекстОшибки = РезультатКода.ТекстОшибки;
		Возврат Ложь;
	КонецЕсли;

	Результат.КодДиаграммы = РезультатКода.КодДиаграммы;
	Возврат Истина;

КонецФункции

// Применить результат рендеринга kroki к итоговому Результату (с fallback на mermaid.js).
Процедура ПрименитьРезультатРендеринга(Результат, Знач РезультатKroki, Знач Оформление)

	Если РезультатKroki.Успех Тогда
		Если Не ПустаяСтрока(РезультатKroki.SVGТекст) Тогда
			Результат.SVGТекст = РезультатKroki.SVGТекст;
			Результат.HTML     = ПостроитьHTMLДляПросмотра(Результат.SVGТекст, Оформление.ФонСтраницы);
		Иначе
			Формат = "png";
			Если РезультатKroki.Свойство("Формат") Тогда
				Формат = РезультатKroki.Формат;
			КонецЕсли;
			Результат.HTML = ПостроитьHTMLДляПросмотраБинарного(
				РезультатKroki.ДвоичныеДанные, Формат, Оформление.ФонСтраницы);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Результат.ВидДиаграммы = "mermaid" Тогда
		Результат.HTML = HTMLДиаграммыMermaid(Результат.КодДиаграммы, Оформление.Тема, Оформление.ФонСтраницы);
		СообщениеЖурнала = СтрШаблон(
			НСтр("ru = 'kroki недоступен, используется mermaid.js: %1'"),
			РезультатKroki.ТекстОшибки);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.ГенераторДиаграмм'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , , СообщениеЖурнала);
		Возврат;
	КонецЕсли;

	Результат.ЭтоОшибка   = Истина;
	Результат.ТекстОшибки = РезультатKroki.ТекстОшибки;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
